Revit 2026 API

# RebarPropagationAlignByHost Method

---
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static ISet<ElementId> AlignByHost(
	Document doc,
	IList<Rebar> sourceRebars,
	Element destinationHost
)
```
```vb
Public Shared Function AlignByHost (
	doc As Document,
	sourceRebars As IList(Of Rebar),
	destinationHost As Element
) As ISet(Of ElementId)
```
```cpp
public:
static ISet<ElementId^>^ AlignByHost(
	Document^ doc,
	IList<Rebar^>^ sourceRebars,
	Element^ destinationHost
)
```
```fsharp
static member AlignByHost :
        doc : Document *
        sourceRebars : IList<Rebar> *
        destinationHost : Element -> ISet<ElementId>
```

#### Parameters

doc Document

sourceRebars IListRebar

destinationHost Element

#### Return Value

ISetElementId

#### Reference

RebarPropagation Class

Autodesk.Revit.DB.Structure Namespace